{
  "entity_tokens": [
    "approval",
    "formula",
    "job",
    "location",
    "machine",
    "material",
    "process",
    "product",
    "proposal",
    "slot",
    "step",
    "storage",
    "type"
  ],
  "generic_threshold": 0.6,
  "generic_tokens": [
    "data",
    "error",
    "id",
    "success"
  ],
  "known_tool_tokens": [
    "0",
    "1",
    "2",
    "4",
    "7",
    "a",
    "action",
    "active",
    "actual",
    "add",
    "ahead",
    "ai",
    "alert",
    "all",
    "allocation",
    "allow",
    "alternative",
    "ambiguou",
    "an",
    "analysi",
    "and",
    "app",
    "applied",
    "apply",
    "approval",
    "approve",
    "approved",
    "arg",
    "array",
    "arrival",
    "arrivalid",
    "arrive",
    "asc",
    "assign",
    "assignment",
    "assist",
    "at",
    "audit",
    "auto",
    "available",
    "availablefrom",
    "backfill",
    "backward",
    "batch",
    "batche",
    "bay",
    "bdi",
    "before",
    "belief",
    "block",
    "blocked",
    "body",
    "bom",
    "bomid",
    "bottleneck",
    "buffer",
    "bullet",
    "buy",
    "by",
    "calendar",
    "call",
    "cancel",
    "cancelled",
    "candidate",
    "capability",
    "capabilityid",
    "capacity",
    "capacityperhour",
    "card",
    "cause",
    "change",
    "changeover",
    "chatbot",
    "check",
    "clarification",
    "cleaning",
    "clear",
    "cnc",
    "coating",
    "cold",
    "command",
    "compat",
    "complete",
    "completed",
    "completion",
    "component",
    "componenttype",
    "composition",
    "computed",
    "confidence",
    "constraint",
    "consume",
    "consumed",
    "conversation",
    "cooling",
    "count",
    "create",
    "created",
    "createdat",
    "current",
    "currentstock",
    "dashboard",
    "data",
    "dataset",
    "date",
    "day",
    "db",
    "deadline",
    "debug",
    "decided",
    "default",
    "defaultchangeovertime",
    "defaultcleaningtime",
    "defaultsetuptime",
    "defect",
    "defectcount",
    "definition",
    "delay",
    "delete",
    "demand",
    "desc",
    "description",
    "desire",
    "detail",
    "deviation",
    "dir",
    "display",
    "dock",
    "downtime",
    "downtimeid",
    "downtimeminute",
    "dry",
    "duration",
    "durationminute",
    "during",
    "e",
    "edd",
    "effect",
    "effectivefrom",
    "effectiveto",
    "efficiency",
    "efficiencyfactor",
    "emit",
    "empty",
    "enabled",
    "end",
    "endtime",
    "entity",
    "epo",
    "error",
    "estimate",
    "etc",
    "event",
    "executable",
    "execute",
    "executed",
    "execution",
    "exist",
    "existing",
    "expected",
    "expectedarriveat",
    "expired",
    "explanation",
    "explicit",
    "explode",
    "explosion",
    "export",
    "factor",
    "factory",
    "fail",
    "failed",
    "fetch",
    "field",
    "fifo",
    "filter",
    "floor",
    "for",
    "forecast",
    "form",
    "formula",
    "formulaid",
    "formulaname",
    "from",
    "g",
    "gap",
    "generate",
    "get",
    "group",
    "guidance",
    "hand",
    "hazardou",
    "hidden",
    "high",
    "holiday",
    "hour",
    "hrs",
    "human",
    "icon",
    "id",
    "idempotency",
    "idle",
    "ids",
    "if",
    "in",
    "include",
    "infer",
    "ingredient",
    "inline",
    "input",
    "insight",
    "inspection",
    "inspectionid",
    "inspectiontime",
    "inspector",
    "inspectorname",
    "instant",
    "instruction",
    "integration",
    "intent",
    "intention",
    "interval",
    "inventory",
    "inventoryid",
    "is",
    "iso",
    "isprimary",
    "issue",
    "item",
    "job",
    "jobid",
    "jobstepid",
    "jobstepslotid",
    "json",
    "key",
    "kg",
    "kind",
    "kpi",
    "label",
    "language",
    "last",
    "lastmaintenancedate",
    "lastupdated",
    "late",
    "lateness",
    "lead",
    "level",
    "limit",
    "link",
    "linked",
    "list",
    "liter",
    "location",
    "lock",
    "log",
    "lookup",
    "low",
    "machine",
    "machineid",
    "machinename",
    "machinetype",
    "maintenance",
    "maintenanceid",
    "maintenanceintervalday",
    "maintenancetype",
    "make",
    "map",
    "matche",
    "material",
    "materialid",
    "materialname",
    "max",
    "measure",
    "medium",
    "message",
    "method",
    "metric",
    "min",
    "minimum",
    "minstock",
    "minute",
    "mode",
    "model",
    "modifier",
    "multiple",
    "mutable",
    "name",
    "needed",
    "neededat",
    "new",
    "next",
    "no",
    "normal",
    "not",
    "note",
    "notification",
    "objective",
    "obsolete",
    "oee",
    "of",
    "offline",
    "offset",
    "omit",
    "on",
    "only",
    "operator",
    "operatornote",
    "option",
    "optional",
    "optiontype",
    "or",
    "order",
    "out",
    "output",
    "overlap",
    "pagination",
    "parallel",
    "parent",
    "parse",
    "pass",
    "path",
    "pause",
    "paused",
    "payload",
    "pcs",
    "pct",
    "penalty",
    "pending",
    "per",
    "percent",
    "percentage",
    "persist",
    "planned",
    "post",
    "predecessor",
    "predictive",
    "prep",
    "preparation",
    "press",
    "preview",
    "primary",
    "priority",
    "process",
    "processid",
    "processing",
    "processname",
    "produced",
    "product",
    "productcomponentid",
    "productid",
    "production",
    "productionid",
    "productname",
    "producttype",
    "proposal",
    "proposed",
    "provided",
    "public",
    "purpose",
    "put",
    "q",
    "qty",
    "quality",
    "quantity",
    "quantityonhand",
    "quantityperunit",
    "quantityproduced",
    "quantityrequired",
    "quantityreserved",
    "quantityscrap",
    "query",
    "rack",
    "range",
    "ranking",
    "rate",
    "read",
    "readable",
    "readiness",
    "readonly",
    "receive",
    "received",
    "receivedat",
    "recipe",
    "recommendation",
    "record",
    "reference",
    "referencejobid",
    "refresh",
    "reject",
    "rejected",
    "released",
    "reorder",
    "reorderlevel",
    "replan",
    "replenish",
    "replenishment",
    "report",
    "request",
    "requested",
    "require",
    "required",
    "reroute",
    "reschedule",
    "reservation",
    "reservationid",
    "reserved",
    "reservedqty",
    "resource",
    "result",
    "resume",
    "retrieve",
    "return",
    "rfc3339",
    "risk",
    "role",
    "routing",
    "run",
    "running",
    "s",
    "safety",
    "safetynote",
    "schedule",
    "scheduled",
    "scheduling",
    "scope",
    "score",
    "scrap",
    "scraprate",
    "secondary",
    "selection",
    "sequence",
    "set",
    "setting",
    "setup",
    "severity",
    "shelf",
    "shortage",
    "side",
    "size",
    "slack",
    "slot",
    "slotid",
    "snapshot",
    "solver",
    "sort",
    "sorting",
    "source",
    "specific",
    "speed",
    "split",
    "splitting",
    "start",
    "starttime",
    "stat",
    "statu",
    "step",
    "stepid",
    "stepsequence",
    "stock",
    "storage",
    "storagelocation",
    "strategy",
    "sub",
    "subproduct",
    "success",
    "suggested",
    "suggestion",
    "summary",
    "target",
    "technician",
    "the",
    "theme",
    "thi",
    "tied",
    "time",
    "title",
    "to",
    "tone",
    "tool",
    "total",
    "trained",
    "training",
    "transfer",
    "transport",
    "trend",
    "true",
    "turn",
    "type",
    "ui",
    "unit",
    "unitofmeasure",
    "unscheduled",
    "update",
    "updated",
    "updatedat",
    "urgent",
    "use",
    "utilization",
    "utilizationrate",
    "valid",
    "validate",
    "value",
    "verify",
    "version",
    "vs",
    "wait",
    "weight",
    "when",
    "window",
    "with",
    "without",
    "work",
    "zone"
  ],
  "operator_tokens": [
    "a",
    "about",
    "all",
    "an",
    "and",
    "any",
    "by",
    "can",
    "check",
    "create",
    "delete",
    "find",
    "for",
    "from",
    "get",
    "give",
    "help",
    "in",
    "into",
    "list",
    "lookup",
    "me",
    "new",
    "of",
    "please",
    "read",
    "remove",
    "show",
    "the",
    "to",
    "update",
    "view",
    "with"
  ],
  "source": "C:\\Users\\dilun\\OneDrive\\Documents\\eMas APi\\emas\\docs\\swagger.json",
  "tool_count": 128
}
